## Terraform Plan Results 🔍

<details>
<summary>Tawa AI Plan</summary>

```terraform
[command]/home/runner/work/_temp/b5b48412-223b-4368-bf5a-4dccddbb57db/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.workload_identity_pool["0"].google_iam_workload_identity_pool.identity_pool will be created
  + resource "google_iam_workload_identity_pool" "identity_pool" {
      + description               = "Identity pool for GitHub Actions automation"
      + disabled                  = false
      + display_name              = "GitHub Actions Identity Pool"
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "tawa-ai"
      + state                     = (known after apply)
      + workload_identity_pool_id = "templafirm-pool"
    }

  # module.workload_identity_pool["0"].google_project_iam_member.terraform_permissions["roles/browser"] will be created
  + resource "google_project_iam_member" "terraform_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:templafirm-gh-actions@tawa-ai.iam.gserviceaccount.com"
      + project = "tawa-ai"
      + role    = "roles/browser"
    }

  # module.workload_identity_pool["0"].google_project_iam_member.terraform_permissions["roles/iam.securityReviewer"] will be created
  + resource "google_project_iam_member" "terraform_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:templafirm-gh-actions@tawa-ai.iam.gserviceaccount.com"
      + project = "tawa-ai"
      + role    = "roles/iam.securityReviewer"
    }

  # module.workload_identity_pool["0"].google_project_iam_member.terraform_permissions["roles/iam.serviceAccountUser"] will be created
  + resource "google_project_iam_member" "terraform_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:templafirm-gh-actions@tawa-ai.iam.gserviceaccount.com"
      + project = "tawa-ai"
      + role    = "roles/iam.serviceAccountUser"
    }

  # module.workload_identity_pool["0"].google_project_iam_member.terraform_permissions["roles/iam.workloadIdentityPoolViewer"] will be created
  + resource "google_project_iam_member" "terraform_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:templafirm-gh-actions@tawa-ai.iam.gserviceaccount.com"
      + project = "tawa-ai"
      + role    = "roles/iam.workloadIdentityPoolViewer"
    }

  # module.workload_identity_pool["0"].google_project_iam_member.terraform_permissions["roles/storage.objectCreator"] will be created
  + resource "google_project_iam_member" "terraform_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:templafirm-gh-actions@tawa-ai.iam.gserviceaccount.com"
      + project = "tawa-ai"
      + role    = "roles/storage.objectCreator"
    }

  # module.workload_identity_pool["0"].google_project_iam_member.terraform_permissions["roles/storage.objectViewer"] will be created
  + resource "google_project_iam_member" "terraform_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:templafirm-gh-actions@tawa-ai.iam.gserviceaccount.com"
      + project = "tawa-ai"
      + role    = "roles/storage.objectViewer"
    }

  # module.workload_identity_pool["0"].google_project_iam_member.terraform_permissions["roles/viewer"] will be created
  + resource "google_project_iam_member" "terraform_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:templafirm-gh-actions@tawa-ai.iam.gserviceaccount.com"
      + project = "tawa-ai"
      + role    = "roles/viewer"
    }

  # module.workload_identity_pool["0"].google_service_account.terraform will be created
  + resource "google_service_account" "terraform" {
      + account_id = "templafirm-gh-actions"
      + disabled   = false
      + email      = "templafirm-gh-actions@tawa-ai.iam.gserviceaccount.com"
      + id         = (known after apply)
      + member     = "serviceAccount:templafirm-gh-actions@tawa-ai.iam.gserviceaccount.com"
      + name       = (known after apply)
      + project    = "tawa-ai"
      + unique_id  = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.workload_identity_pool["0"].google_iam_workload_identity_pool.identity_pool will be created%0A  + resource "google_iam_workload_identity_pool" "identity_pool" {%0A      + description               = "Identity pool for GitHub Actions automation"%0A      + disabled                  = false%0A      + display_name              = "GitHub Actions Identity Pool"%0A      + id                        = (known after apply)%0A      + name                      = (known after apply)%0A      + project                   = "tawa-ai"%0A      + state                     = (known after apply)%0A      + workload_identity_pool_id = "templafirm-pool"%0A    }%0A%0A  # module.workload_identity_pool["0"].google_project_iam_member.terraform_permissions["roles/browser"] will be created%0A  + resource "google_project_iam_member" "terraform_permissions" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = "serviceAccount:templafirm-gh-actions@tawa-ai.iam.gserviceaccount.com"%0A      + project = "tawa-ai"%0A      + role    = "roles/browser"%0A    }%0A%0A  # module.workload_identity_pool["0"].google_project_iam_member.terraform_permissions["roles/iam.securityReviewer"] will be created%0A  + resource "google_project_iam_member" "terraform_permissions" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = "serviceAccount:templafirm-gh-actions@tawa-ai.iam.gserviceaccount.com"%0A      + project = "tawa-ai"%0A      + role    = "roles/iam.securityReviewer"%0A    }%0A%0A  # module.workload_identity_pool["0"].google_project_iam_member.terraform_permissions["roles/iam.serviceAccountUser"] will be created%0A  + resource "google_project_iam_member" "terraform_permissions" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = "serviceAccount:templafirm-gh-actions@tawa-ai.iam.gserviceaccount.com"%0A      + project = "tawa-ai"%0A      + role    = "roles/iam.serviceAccountUser"%0A    }%0A%0A  # module.workload_identity_pool["0"].google_project_iam_member.terraform_permissions["roles/iam.workloadIdentityPoolViewer"] will be created%0A  + resource "google_project_iam_member" "terraform_permissions" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = "serviceAccount:templafirm-gh-actions@tawa-ai.iam.gserviceaccount.com"%0A      + project = "tawa-ai"%0A      + role    = "roles/iam.workloadIdentityPoolViewer"%0A    }%0A%0A  # module.workload_identity_pool["0"].google_project_iam_member.terraform_permissions["roles/storage.objectCreator"] will be created%0A  + resource "google_project_iam_member" "terraform_permissions" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = "serviceAccount:templafirm-gh-actions@tawa-ai.iam.gserviceaccount.com"%0A      + project = "tawa-ai"%0A      + role    = "roles/storage.objectCreator"%0A    }%0A%0A  # module.workload_identity_pool["0"].google_project_iam_member.terraform_permissions["roles/storage.objectViewer"] will be created%0A  + resource "google_project_iam_member" "terraform_permissions" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = "serviceAccount:templafirm-gh-actions@tawa-ai.iam.gserviceaccount.com"%0A      + project = "tawa-ai"%0A      + role    = "roles/storage.objectViewer"%0A    }%0A%0A  # module.workload_identity_pool["0"].google_project_iam_member.terraform_permissions["roles/viewer"] will be created%0A  + resource "google_project_iam_member" "terraform_permissions" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = "serviceAccount:templafirm-gh-actions@tawa-ai.iam.gserviceaccount.com"%0A      + project = "tawa-ai"%0A      + role    = "roles/viewer"%0A    }%0A%0A  # module.workload_identity_pool["0"].google_service_account.terraform will be created%0A  + resource "google_service_account" "terraform" {%0A      + account_id = "templafirm-gh-actions"%0A      + disabled   = false%0A      + email      = "templafirm-gh-actions@tawa-ai.iam.gserviceaccount.com"%0A      + id         = (known after apply)%0A      + member     = "serviceAccount:templafirm-gh-actions@tawa-ai.iam.gserviceaccount.com"%0A      + name       = (known after apply)%0A      + project    = "tawa-ai"%0A      + unique_id  = (known after apply)%0A    }%0A%0APlan: 9 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>

*Workflow: [Terraform Plan on PR](https://github.com/tawa-ai/kakhovka/actions/runs/15050453235)*